<a href="https://colab.research.google.com/github/SwathyKrishna02/data_cleaning_and_manipulation_using_Pandas_and_Numpy/blob/main/Week_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. How to load data?
2. How to work on csv / tsv file?
3. Basic Statistics on Data.
4. Data Cleaning with each column.
5. Choice description
6. Regular Expression
7. Solve some questions from dataset.

In [2]:
# importing libraries
import numpy as np
import pandas as pd

## Read Data

In [ ]:
data = pd.read_csv("/content/Data-cleaning-for-beginners-using-pandas.csv")
print(data)

    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       India,In         1999       TRUE
1       1  66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2       2   NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3       3  64.0   $44k-$99k     4.4       India In         1988         -1
4       4  25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5       5  44.0   $77k-$89k     1.4       India,In         1999       TRUE
6       6  21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8       8  35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9       9  22.0   $44k-$99k     7.7       India,In           -1       TRUE
10     10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11     11  44.0   $10k-$49k     6.7       India,In         2009         -1
12     12   NaN   $44k-$99k     0.0       India,In         1999         -1
13     13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16     16  19.0   $19k-$40k     4.5       India,In         1984         -1
17     17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20     20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22     22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23     23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25     25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26     26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27     27  52.0   $44k-$99k     5.4       India,In         1935         -1
28     28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

Missing values

---



---

In [ ]:
data.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [ ]:
age=data["Age"].mean()
print(age)

39.04545454545455

In [ ]:
rating=data["Rating"].mean()
print(rating)

3.528571428571429

In [ ]:
data['Age']=data.Age.fillna(age)
data['Age']=data.Age.round(decimals=1)

In [ ]:
data["Age"]

0     44.0
1     66.0
2     39.0
3     64.0
4     25.0
5     44.0
6     21.0
7     44.0
8     35.0
9     22.0
10    55.0
11    44.0
12    39.0
13    25.0
14    66.0
15    44.0
16    19.0
17    39.0
18    35.0
19    32.0
20    39.0
21    35.0
22    19.0
23    39.0
24    13.0
25    55.0
26    39.0
27    52.0
28    39.0
Name: Age, dtype: float64

In [ ]:
data['Rating'] = data.Rating.fillna(rating)
data['Rating'] = data.Rating.round(decimals=1)

In [ ]:
data['Rating']

0     5.4
1     3.5
2    -1.0
3     4.4
4     6.4
5     1.4
6     0.0
7    -1.0
8     5.4
9     7.7
10    5.4
11    6.7
12    0.0
13   -1.0
14    4.0
15    3.0
16    4.5
17    5.3
18    6.7
19    3.3
20    5.7
21    5.0
22    7.8
23    2.4
24   -1.0
25    0.0
26    3.5
27    5.4
28    3.4
Name: Rating, dtype: float64

Data Types

In [ ]:
print(data.dtypes)

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [ ]:
data_types = data.dtypes

for column, dtype in data_types.items():
    print(f"{column}: {dtype}")

    if data[column].dtype == 'object':
        print(f"Expected Type: Categorical")
    elif data[column].dtype == 'float64':
        print(f"Expected Type: Numerical")


    print()

Index: int64

Age: float64
Expected Type: Numerical

Salary: object
Expected Type: Categorical

Rating: float64
Expected Type: Numerical

Location: object
Expected Type: Categorical

Established: int64

Easy Apply: object
Expected Type: Categorical

Outliers

In [ ]:
z_score = 3

z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())

data_no_outliers = data[(z_scores <= z_score).all(axis=1)]

print("Dataset after removing outliers:")
print(data_no_outliers)

Dataset after removing outliers:
Empty DataFrame
Columns: [Index, Age, Salary, Rating, Location, Established, Easy Apply]
Index: []

<ipython-input-24-8241feab361b>:3: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())
<ipython-input-24-8241feab361b>:3: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  z_scores = np.abs((data[['Age', 'Salary', 'Rating']] - data[['Age', 'Salary', 'Rating']].mean()) / data[['Age', 'Salary', 'Rating']].std())

Salary formatting

In [ ]:
data["Salary"]

0      $44k-$99k
1      $55k-$66k
2      $77k-$89k
3      $44k-$99k
4      $44k-$99k
5      $77k-$89k
6      $44k-$99k
7      $44k-$99k
8      $44k-$99k
9      $44k-$99k
10     $10k-$49k
11     $10k-$49k
12     $44k-$99k
13     $44k-$99k
14     $44k-$99k
15    $88k-$101k
16     $19k-$40k
17     $44k-$99k
18     $44k-$99k
19     $44k-$99k
20     $44k-$99k
21     $44k-$99k
22     $55k-$66k
23     $44k-$99k
24     $44k-$99k
25     $44k-$99k
26     $55k-$66k
27     $44k-$99k
28     $39k-$88k
Name: Salary, dtype: object

In [ ]:
salary_values = data['Salary'].unique()

print("Unique values in Salary:")
print(salary_values)

pattern_counts = data['Salary'].value_counts()

print("Counts of Salary:")
print(pattern_counts)


missing_salary = data['Salary'].isnull().sum()

print("Missing values in Salary:", missing_salary)

Unique values in Salary:
['$44k-$99k' '$55k-$66k' '$77k-$89k' '$10k-$49k' '$88k-$101k' '$19k-$40k'
 '$39k-$88k']
Counts of Salary:
$44k-$99k     19
$55k-$66k      3
$77k-$89k      2
$10k-$49k      2
$88k-$101k     1
$19k-$40k      1
$39k-$88k      1
Name: Salary, dtype: int64
Missing values in Salary: 0

Location Standarization

In [ ]:
locations = data['Location'].unique()

print("Unique values in Location:")
print(locations)

data['Location'] = data['Location'].str.lower()

print("After standardizing Location:")
print(data)

Unique values in Location:
['India,In' 'New York,Ny' 'India In' 'Australia Aus']
After standardizing Location:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999       TRUE
1       1  66.0   $55k-$66k     3.5    new york,ny         2002       TRUE
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1         -1
3       3  64.0   $44k-$99k     4.4       india in         1988         -1
4       4  25.0   $44k-$99k     6.4  australia aus         2002         -1
5       5  44.0   $77k-$89k     1.4       india,in         1999       TRUE
6       6  21.0   $44k-$99k     0.0    new york,ny           -1         -1
7       7  44.0   $44k-$99k    -1.0  australia aus           -1         -1
8       8  35.0   $44k-$99k     5.4    new york,ny           -1         -1
9       9  22.0   $44k-$99k     7.7       india,in           -1       TRUE
10     10  55.0   $10k-$49k     5.4       india,in         2008       TRUE
11     11  44.0   $10k-$49k     6.7       india,in         2009         -1
12     12  39.0   $44k-$99k     0.0       india,in         1999         -1
13     13  25.0   $44k-$99k    -1.0  australia aus         2019       TRUE
14     14  66.0   $44k-$99k     4.0  australia aus         2020       TRUE
15     15  44.0  $88k-$101k     3.0  australia aus         1999         -1
16     16  19.0   $19k-$40k     4.5       india,in         1984         -1
17     17  39.0   $44k-$99k     5.3    new york,ny         1943       TRUE
18     18  35.0   $44k-$99k     6.7    new york,ny         1954       TRUE
19     19  32.0   $44k-$99k     3.3    new york,ny         1955       TRUE
20     20  39.0   $44k-$99k     5.7    new york,ny         1944       TRUE
21     21  35.0   $44k-$99k     5.0    new york,ny         1946         -1
22     22  19.0   $55k-$66k     7.8    new york,ny         1988       TRUE
23     23  39.0   $44k-$99k     2.4    new york,ny         1999       TRUE
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987         -1
25     25  55.0   $44k-$99k     0.0  australia aus         1980       TRUE
26     26  39.0   $55k-$66k     3.5       india,in         1934       TRUE
27     27  52.0   $44k-$99k     5.4       india,in         1935         -1
28     28  39.0   $39k-$88k     3.4  australia aus         1932         -1

Easy Apply Indicator

In [ ]:
easy_apply = data['Easy Apply'].unique()

print("Unique values in Easy Apply:")
print(easy_apply)

easy_apply_data_type = data['Easy Apply'].dtype

print("\nData type of Easy Apply:", easy_apply_data_type)

if easy_apply_data_type != bool:
    data['Easy Apply'] = data['Easy Apply'].map({'TRUE': True, 'FALSE': False})

print("after potential transformation")
print(data)

Unique values in Easy Apply:
['TRUE' '-1']

Data type of Easy Apply: object
after potential transformation
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999       True
1       1  66.0   $55k-$66k     3.5    new york,ny         2002       True
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999       True
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1       True
10     10  55.0   $10k-$49k     5.4       india,in         2008       True
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019       True
14     14  66.0   $44k-$99k     4.0  australia aus         2020       True
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943       True
18     18  35.0   $44k-$99k     6.7    new york,ny         1954       True
19     19  32.0   $44k-$99k     3.3    new york,ny         1955       True
20     20  39.0   $44k-$99k     5.7    new york,ny         1944       True
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988       True
23     23  39.0   $44k-$99k     2.4    new york,ny         1999       True
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980       True
26     26  39.0   $55k-$66k     3.5       india,in         1934       True
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

Age Distribution

In [ ]:
age = data['Age'].describe()

print("Summary statistics for Age:")
print(age)

age_values = data['Age'].unique()
age_counts = data['Age'].value_counts()

print("\nUnique values in the 'Age' column:")
print(age_values)

print("\nCounts for each unique age value:")
print(age_counts)

Summary statistics for Age:
count    29.000000
mean     39.034483
std      13.973145
min      13.000000
25%      32.000000
50%      39.000000
75%      44.000000
max      66.000000
Name: Age, dtype: float64

Unique values in the 'Age' column:
[44. 66. 39. 64. 25. 21. 35. 22. 55. 19. 32. 13. 52.]

Counts for each unique age value:
39.0    7
44.0    5
35.0    3
66.0    2
25.0    2
55.0    2
19.0    2
64.0    1
21.0    1
22.0    1
32.0    1
13.0    1
52.0    1
Name: Age, dtype: int64

Handling Special Characters

In [ ]:
text = ['Location']

for column in text:
    unique_values = data[column].unique()
    print(f"Unique values in '{column}' column:")
    print(unique_values)


data['Location'] = data['Location'].str.replace(r'[^a-zA-Z0-9\s,]', '', regex=True)
data['Location'] = data['Location'].str.strip()


print("After cleaning text-based columns:")
print(data)

Unique values in 'Location' column:
['india,in' 'new york,ny' 'india in' 'australia aus']
After cleaning text-based columns:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999       True
1       1  66.0   $55k-$66k     3.5    new york,ny         2002       True
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999       True
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1       True
10     10  55.0   $10k-$49k     5.4       india,in         2008       True
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019       True
14     14  66.0   $44k-$99k     4.0  australia aus         2020       True
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943       True
18     18  35.0   $44k-$99k     6.7    new york,ny         1954       True
19     19  32.0   $44k-$99k     3.3    new york,ny         1955       True
20     20  39.0   $44k-$99k     5.7    new york,ny         1944       True
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988       True
23     23  39.0   $44k-$99k     2.4    new york,ny         1999       True
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980       True
26     26  39.0   $55k-$66k     3.5       india,in         1934       True
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

Data Integrity

In [ ]:
entries = data[data['Age'] != -1]
entries = entries[(entries['Established'] != -1) & (entries['Age'] - entries['Established'] < 0)]

print("Entries where 'Age' and 'Established':")
print(entries[['Age', 'Established']])

data.loc[data['Age'] == -1, 'Age'] = data['Established'] - data['Established'].min()


print("After handling misaligned entries:")
print(data)

Entries where 'Age' and 'Established':
     Age  Established
0   44.0         1999
1   66.0         2002
3   64.0         1988
4   25.0         2002
5   44.0         1999
10  55.0         2008
11  44.0         2009
12  39.0         1999
13  25.0         2019
14  66.0         2020
15  44.0         1999
16  19.0         1984
17  39.0         1943
18  35.0         1954
19  32.0         1955
20  39.0         1944
21  35.0         1946
22  19.0         1988
23  39.0         1999
24  13.0         1987
25  55.0         1980
26  39.0         1934
27  52.0         1935
28  39.0         1932
After handling misaligned entries:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999       True
1       1  66.0   $55k-$66k     3.5    new york,ny         2002       True
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999       True
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1       True
10     10  55.0   $10k-$49k     5.4       india,in         2008       True
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019       True
14     14  66.0   $44k-$99k     4.0  australia aus         2020       True
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943       True
18     18  35.0   $44k-$99k     6.7    new york,ny         1954       True
19     19  32.0   $44k-$99k     3.3    new york,ny         1955       True
20     20  39.0   $44k-$99k     5.7    new york,ny         1944       True
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988       True
23     23  39.0   $44k-$99k     2.4    new york,ny         1999       True
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980       True
26     26  39.0   $55k-$66k     3.5       india,in         1934       True
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

Easy Apply Transformation

In [ ]:
easy_apply = data['Easy Apply'].unique()

print("Unique values in  Easy Apply:")
print(easy_apply)

easy_apply_data_type = data['Easy Apply'].dtype

print("Data type of Easy Apply:", easy_apply_data_type)

if easy_apply_data_type != bool:
    data['Easy Apply'] = data['Easy Apply'].map({'TRUE': True, 'FALSE': False})

print("After transforming Easy Apply:")
print(data)

Unique values in  Easy Apply:
[nan]
Data type of Easy Apply: object
After transforming Easy Apply:
    Index   Age      Salary  Rating       Location  Established Easy Apply
0       0  44.0   $44k-$99k     5.4       india,in         1999        NaN
1       1  66.0   $55k-$66k     3.5    new york,ny         2002        NaN
2       2  39.0   $77k-$89k    -1.0    new york,ny           -1        NaN
3       3  64.0   $44k-$99k     4.4       india in         1988        NaN
4       4  25.0   $44k-$99k     6.4  australia aus         2002        NaN
5       5  44.0   $77k-$89k     1.4       india,in         1999        NaN
6       6  21.0   $44k-$99k     0.0    new york,ny           -1        NaN
7       7  44.0   $44k-$99k    -1.0  australia aus           -1        NaN
8       8  35.0   $44k-$99k     5.4    new york,ny           -1        NaN
9       9  22.0   $44k-$99k     7.7       india,in           -1        NaN
10     10  55.0   $10k-$49k     5.4       india,in         2008        NaN
11     11  44.0   $10k-$49k     6.7       india,in         2009        NaN
12     12  39.0   $44k-$99k     0.0       india,in         1999        NaN
13     13  25.0   $44k-$99k    -1.0  australia aus         2019        NaN
14     14  66.0   $44k-$99k     4.0  australia aus         2020        NaN
15     15  44.0  $88k-$101k     3.0  australia aus         1999        NaN
16     16  19.0   $19k-$40k     4.5       india,in         1984        NaN
17     17  39.0   $44k-$99k     5.3    new york,ny         1943        NaN
18     18  35.0   $44k-$99k     6.7    new york,ny         1954        NaN
19     19  32.0   $44k-$99k     3.3    new york,ny         1955        NaN
20     20  39.0   $44k-$99k     5.7    new york,ny         1944        NaN
21     21  35.0   $44k-$99k     5.0    new york,ny         1946        NaN
22     22  19.0   $55k-$66k     7.8    new york,ny         1988        NaN
23     23  39.0   $44k-$99k     2.4    new york,ny         1999        NaN
24     24  13.0   $44k-$99k    -1.0    new york,ny         1987        NaN
25     25  55.0   $44k-$99k     0.0  australia aus         1980        NaN
26     26  39.0   $55k-$66k     3.5       india,in         1934        NaN
27     27  52.0   $44k-$99k     5.4       india,in         1935        NaN
28     28  39.0   $39k-$88k     3.4  australia aus         1932        NaN

Handling Categorical Data

In [ ]:
data_types = data.dtypes

print("Data types:")
print(data_types)

categorical_columns = data.select_dtypes(include=['object']).columns

print("Categorical:")
print(categorical_columns)


data_encoded = pd.get_dummies(data, columns=categorical_columns, drop_first=True)


print("After one-hot encoding categorical:")
print(data_encoded)

Data types:
Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object
Categorical:
Index(['Salary', 'Location', 'Easy Apply'], dtype='object')
After one-hot encoding categorical:
    Index   Age  Rating  Established  Salary_$19k-$40k  Salary_$39k-$88k  \
0       0  44.0     5.4         1999                 0                 0
1       1  66.0     3.5         2002                 0                 0
2       2  39.0    -1.0           -1                 0                 0
3       3  64.0     4.4         1988                 0                 0
4       4  25.0     6.4         2002                 0                 0
5       5  44.0     1.4         1999                 0                 0
6       6  21.0     0.0           -1                 0                 0
7       7  44.0    -1.0           -1                 0                 0
8       8  35.0     5.4           -1                 0                 0
9       9  22.0     7.7           -1                 0                 0
10     10  55.0     5.4         2008                 0                 0
11     11  44.0     6.7         2009                 0                 0
12     12  39.0     0.0         1999                 0                 0
13     13  25.0    -1.0         2019                 0                 0
14     14  66.0     4.0         2020                 0                 0
15     15  44.0     3.0         1999                 0                 0
16     16  19.0     4.5         1984                 1                 0
17     17  39.0     5.3         1943                 0                 0
18     18  35.0     6.7         1954                 0                 0
19     19  32.0     3.3         1955                 0                 0
20     20  39.0     5.7         1944                 0                 0
21     21  35.0     5.0         1946                 0                 0
22     22  19.0     7.8         1988                 0                 0
23     23  39.0     2.4         1999                 0                 0
24     24  13.0    -1.0         1987                 0                 0
25     25  55.0     0.0         1980                 0                 0
26     26  39.0     3.5         1934                 0                 0
27     27  52.0     5.4         1935                 0                 0
28     28  39.0     3.4         1932                 0                 1

    Salary_$44k-$99k  Salary_$55k-$66k  Salary_$77k-$89k  Salary_$88k-$101k  \
0                  1                 0                 0                  0
1                  0                 1                 0                  0
2                  0                 0                 1                  0
3                  1                 0                 0                  0
4                  1                 0                 0                  0
5                  0                 0                 1                  0
6                  1                 0                 0                  0
7                  1                 0                 0                  0
8                  1                 0                 0                  0
9                  1                 0                 0                  0
10                 0                 0                 0                  0
11                 0                 0                 0                  0
12                 1                 0                 0                  0
13                 1                 0                 0                  0
14                 1                 0                 0                  0
15                 0                 0                 0                  1
16                 0                 0                 0                  0
17                 1                 0                 0                  0
18                 1                 0                 0                  0
19                 1                 0                 0                  0
20                 1                 0                 0                  0
21                 1                 0                 0                  0
22                 0                 1                 0                  0
23                 1                 0                 0                  0
24                 1                 0                 0                  0
25                 1                 0                 0                  0
26                 0                 1                 0                  0
27                 1                 0                 0                  0
28                 0                 0                 0                  0

    Location_india in  Location_india,in  Location_new york,ny
0                   0                  1                     0
1                   0                  0                     1
2                   0                  0                     1
3                   1                  0                     0
4                   0                  0                     0
5                   0                  1                     0
6                   0                  0                     1
7                   0                  0                     0
8                   0                  0                     1
9                   0                  1                     0
10                  0                  1                     0
11                  0                  1                     0
12                  0                  1                     0
13                  0                  0                     0
14                  0                  0                     0
15                  0                  0                     0
16                  0                  1                     0
17                  0                  0                     1
18                  0                  0                     1
19                  0                  0                     1
20                  0                  0                     1
21                  0                  0                     1
22                  0                  0                     1
23                  0                  0                     1
24                  0                  0                     1
25                  0                  0                     0
26                  0                  1                     0
27                  0                  1                     0
28                  0                  0                     0

# What questions you can find in dataset 2(chipotle)?
Before you actually answer these questions i will assume you have performed data cleaning.

1. Quantity of each item? (Top 5 itmes available in store)
2. which is most ordered item in choice_description?
3. What is total order count?
4. What is reveneu?
5. what are number of orders?
6. Whta is average revenue amount per order?
7. How many different items are sold?
8. what is revenue from each product?


1. Find the unique items
2. Find total cost and quantity of every unique items
3. Find the average of every unique item
4. Replace the items if abnormal with avg

In [4]:
data1 = pd.read_csv("/content/chipotle.tsv",sep='\t')
data1

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

Missing Values

In [9]:
missing = data1.isnull().sum()
print(missing)
data_cleaned = data1.dropna()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

Data Types

In [14]:
print(data1.dtypes)

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

Duplicate Entries

In [19]:
duplicate=data1[data1.duplicated()]
print(duplicate)

no_duplicate = data1.drop_duplicates()

      order_id  quantity                            item_name  \
238        103         1                        Steak Burrito
248        108         1                          Canned Soda
297        129         1                        Steak Burrito
381        165         1                    Canned Soft Drink
484        205         1                         Chicken Bowl
567        233         1                    Canned Soft Drink
617        254         1                                Chips
684        282         1                    Canned Soft Drink
773        319         1                         Chicken Bowl
908        376         1                        Steak Burrito
924        381         1                   Chicken Soft Tacos
1003       412         1                        Bottled Water
1117       462         1                      Chicken Burrito
1203       491         1                      Chicken Burrito
1245       507         1                    Canned Soft Drink
1381       561         1                    Canned Soft Drink
1410       573         1                        Bottled Water
1420       576         1                        Barbacoa Bowl
1421       576         1                  Barbacoa Salad Bowl
1502       610         1                      Chicken Burrito
1534       624         1  Chips and Tomatillo-Red Chili Salsa
1548       628         1                  Chips and Guacamole
1612       651         1                                 Izze
1791       724         1                    Canned Soft Drink
1792       724         1                    Canned Soft Drink
2078       838         1                   Chicken Soft Tacos
2127       856         1                      Chicken Burrito
2307       926         1                         Chicken Bowl
2318       926         1                         Chicken Bowl
2362       940         1                    Canned Soft Drink
2448       972         1                         Chicken Bowl
2553      1011         1                    Canned Soft Drink
2554      1011         1                    Canned Soft Drink
2560      1013         1                  Chips and Guacamole
2576      1020         1  Chips and Tomatillo Red Chili Salsa
2662      1057         1                   Chicken Soft Tacos
2708      1074         1                                Chips
2717      1078         1                         Chicken Bowl
2833      1125         1                      Chicken Burrito
2881      1144         1                        Bottled Water
2973      1182         1                         Chicken Bowl
2977      1184         1                           Steak Bowl
3121      1244         1                  Chips and Guacamole
3430      1377         1  Chips and Tomatillo Red Chili Salsa
3637      1454         1                   Chicken Soft Tacos
3716      1484         1                          Canned Soda
3764      1507         1                      Chicken Burrito
3829      1534         1                      Chicken Burrito
3924      1574         1                        Bottled Water
4112      1647         1                         Chicken Bowl
4155      1660         1                  Chips and Guacamole
4236      1691         1                         Chicken Bowl
4266      1701         1                                Chips
4372      1745         1                  Chips and Guacamole
4463      1778         1                    Canned Soft Drink
4479      1785         1                        Bottled Water
4544      1806         1                        Bottled Water
4570      1817         1                        Bottled Water
4603      1827         1                     Barbacoa Burrito

                                     choice_description item_price
238   [Tomatillo Red Chili Salsa, [Rice, Black Beans...    $11.75
248                                      [Mountain Dew]     $1.09
297   [Tomatillo Green Chili Salsa, [Rice, Cheese, G...    $11.75
381                                              [Coke]     $1.25
484   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...     $8.75
567                                         [Diet Coke]     $1.25
617                                                 NaN     $2.15
684                                              [Coke]     $1.25
773   [Tomatillo-Green Chili Salsa (Medium), Black B...     $8.49
908   [Roasted Chili Corn Salsa (Medium), [Rice, Faj...     $8.99
924           [Tomatillo-Red Chili Salsa (Hot), Cheese]     $8.49
1003                                                NaN     $1.50
1117  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...    $11.25
1203  [Fresh Tomato Salsa, [Cheese, Sour Cream, Lett...     $8.75
1245                                         [Lemonade]     $1.25
1381                                             [Coke]     $1.25
1410                                                NaN     $1.50
1420                         [Roasted Chili Corn Salsa]     $9.25
1421                         [Roasted Chili Corn Salsa]     $9.39
1502  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...     $8.75
1534                                                NaN     $2.39
1548                                                NaN     $4.45
1612                                       [Blackberry]     $3.39
1791                                             [Coke]     $1.25
1792                                             [Coke]     $1.25
2078  [Fresh Tomato Salsa, [Cheese, Sour Cream, Lett...     $8.75
2127  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...    $11.25
2307  [Roasted Chili Corn Salsa, [Fajita Vegetables,...     $8.75
2318  [Roasted Chili Corn Salsa, [Fajita Vegetables,...     $8.75
2362                                             [Coke]     $1.25
2448  [Tomatillo Red Chili Salsa, [Rice, Black Beans...     $8.75
2553                                             [Coke]     $1.25
2554                                             [Coke]     $1.25
2560                                                NaN     $4.45
2576                                                NaN     $2.95
2662  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.25
2708                                                NaN     $2.15
2717  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...    $11.25
2833      [Fresh Tomato Salsa, [Rice, Cheese, Lettuce]]     $8.75
2881                                                NaN     $1.50
2973  [Tomatillo-Red Chili Salsa (Hot), [Rice, Black...     $8.49
2977  [Fresh Tomato Salsa, [Rice, Pinto Beans, Chees...     $9.25
3121                                                NaN     $4.45
3430                                                NaN     $2.95
3637                         [Fresh Tomato Salsa, Rice]     $8.75
3716                                       [Dr. Pepper]     $1.09
3764  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     $8.75
3829  [Fresh Tomato Salsa, [Rice, Cheese, Sour Cream...     $8.75
3924                                                NaN     $1.50
4112  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...    $11.25
4155                                                NaN     $4.45
4236                                       [White Rice]     $8.50
4266                                                NaN     $2.15
4372                                                NaN     $4.45
4463                                         [Lemonade]     $1.25
4479                                                NaN     $1.50
4544                                                NaN     $1.50
4570                                                NaN     $1.50
4603                      [Tomatillo Green Chili Salsa]     $9.25

Choice Description

In [22]:
data1['combined_description'] = data1.groupby('item_name')['choice_description'].transform(lambda x: ', '.join(x.dropna()))
unique_items = data1[['item_name', 'combined_description']].drop_duplicates()
print(unique_items)

                                  item_name  \
0              Chips and Fresh Tomato Salsa
1                                      Izze
2                          Nantucket Nectar
3     Chips and Tomatillo-Green Chili Salsa
4                              Chicken Bowl
6                             Side of Chips
7                             Steak Burrito
8                          Steak Soft Tacos
10                      Chips and Guacamole
11                     Chicken Crispy Tacos
12                       Chicken Soft Tacos
16                          Chicken Burrito
18                              Canned Soda
21                         Barbacoa Burrito
27                         Carnitas Burrito
33                            Carnitas Bowl
34                            Bottled Water
38    Chips and Tomatillo Green Chili Salsa
39                            Barbacoa Bowl
40                                    Chips
44                       Chicken Salad Bowl
54                               Steak Bowl
56                      Barbacoa Soft Tacos
57                           Veggie Burrito
62                              Veggie Bowl
92                       Steak Crispy Tacos
111     Chips and Tomatillo Red Chili Salsa
168                   Barbacoa Crispy Tacos
186                       Veggie Salad Bowl
191      Chips and Roasted Chili-Corn Salsa
233      Chips and Roasted Chili Corn Salsa
237                     Carnitas Soft Tacos
250                           Chicken Salad
263                       Canned Soft Drink
281                        Steak Salad Bowl
298                       6 Pack Soft Drink
300     Chips and Tomatillo-Red Chili Salsa
445                                    Bowl
510                                 Burrito
520                            Crispy Tacos
554                   Carnitas Crispy Tacos
664                             Steak Salad
674       Chips and Mild Fresh Tomato Salsa
738                       Veggie Soft Tacos
1132                    Carnitas Salad Bowl
1229                    Barbacoa Salad Bowl
1414                                  Salad
1653                    Veggie Crispy Tacos
1694                           Veggie Salad
3750                         Carnitas Salad

                                   combined_description
0
1     [Clementine], [Grapefruit], [Blackberry], [Bla...
2     [Apple], [Pomegranate Cherry], [Pineapple Oran...
3
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
6
7     [Tomatillo Red Chili Salsa, [Fajita Vegetables...
8     [Tomatillo Green Chili Salsa, [Pinto Beans, Ch...
10
11    [Roasted Chili Corn Salsa, [Fajita Vegetables,...
12    [Roasted Chili Corn Salsa, [Rice, Black Beans,...
16    [Tomatillo-Green Chili Salsa (Medium), [Pinto ...
18    [Sprite], [Dr. Pepper], [Mountain Dew], [Sprit...
21    [[Fresh Tomato Salsa (Mild), Tomatillo-Green C...
27    [[Tomatillo-Green Chili Salsa (Medium), Roaste...
33    [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
34
38
39    [Roasted Chili Corn Salsa, [Fajita Vegetables,...
40
44    [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...
54    [Fresh Tomato Salsa (Mild), [Black Beans, Rice...
56    [Fresh Tomato Salsa, [Fajita Vegetables, Black...
57    [Tomatillo Red Chili Salsa, [Fajita Vegetables...
62    [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...
92    [Fresh Tomato Salsa, Sour Cream], [[Roasted Ch...
111
168   [Tomatillo Red Chili Salsa, [Rice, Black Beans...
186   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...
191
233
237   [Tomatillo Green Chili Salsa, [Fajita Vegetabl...
250   [Roasted Chili Corn Salsa (Medium), [Black Bea...
263   [Coke], [Sprite], [Coke], [Coke], [Lemonade], ...
281   [Tomatillo Red Chili Salsa, [Black Beans, Chee...
298   [Sprite], [Diet Coke], [Coke], [Diet Coke], [D...
300
445   [Braised Carnitas, Pinto Beans, [Sour Cream, C...
510   [Adobo-Marinated and Grilled Chicken, Pinto Be...
520   [Adobo-Marinated and Grilled Steak], [Adobo-Ma...
554   [Roasted Chili Corn Salsa], [Tomatillo Green C...
664   [Tomatillo-Red Chili Salsa (Hot), [Black Beans...
674
738   [Tomatillo Red Chili Salsa, [Fajita Vegetables...
1132  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...
1229  [Fresh Tomato Salsa, [Rice, Fajita Vegetables,...
1414  [Brown Rice, Adobo-Marinated and Grilled Chick...
1653  [Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...
1694  [[Fresh Tomato Salsa (Mild), Roasted Chili Cor...
3750  [[Fresh Tomato Salsa (Mild), Roasted Chili Cor...

Item Name Standardization

In [25]:
unique_names = data1['item_name'].unique()
data1['standardized'] = data1['item_name'].str.lower()
print(data1[['item_name', 'standardized']].head())

                               item_name  \
0           Chips and Fresh Tomato Salsa
1                                   Izze
2                       Nantucket Nectar
3  Chips and Tomatillo-Green Chili Salsa
4                           Chicken Bowl

                            standardized
0           chips and fresh tomato salsa
1                                   izze
2                       nantucket nectar
3  chips and tomatillo-green chili salsa
4                           chicken bowl

Categorical Data

In [27]:
encoded = pd.get_dummies(data1, columns=['item_name'], prefix='item')
print(encoded.head())

   order_id  quantity                                 choice_description  \
0         1         1                                                NaN
1         1         1                                       [Clementine]
2         1         1                                            [Apple]
3         1         1                                                NaN
4         2         2  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...

  item_price                               Combined_Description  \
0     $2.39
1     $3.39   [Clementine], [Grapefruit], [Blackberry], [Bla...
2     $3.39   [Apple], [Pomegranate Cherry], [Pineapple Oran...
3     $2.39
4    $16.98   [Tomatillo-Red Chili Salsa (Hot), [Black Beans...

                                combined_description  \
0
1  [Clementine], [Grapefruit], [Blackberry], [Bla...
2  [Apple], [Pomegranate Cherry], [Pineapple Oran...
3
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...

                            standardized  item_6 Pack Soft Drink  \
0           chips and fresh tomato salsa                       0
1                                   izze                       0
2                       nantucket nectar                       0
3  chips and tomatillo-green chili salsa                       0
4                           chicken bowl                       0

   item_Barbacoa Bowl  item_Barbacoa Burrito  ...  item_Steak Crispy Tacos  \
0                   0                      0  ...                        0
1                   0                      0  ...                        0
2                   0                      0  ...                        0
3                   0                      0  ...                        0
4                   0                      0  ...                        0

   item_Steak Salad  item_Steak Salad Bowl  item_Steak Soft Tacos  \
0                 0                      0                      0
1                 0                      0                      0
2                 0                      0                      0
3                 0                      0                      0
4                 0                      0                      0

   item_Veggie Bowl  item_Veggie Burrito  item_Veggie Crispy Tacos  \
0                 0                    0                         0
1                 0                    0                         0
2                 0                    0                         0
3                 0                    0                         0
4                 0                    0                         0

   item_Veggie Salad  item_Veggie Salad Bowl  item_Veggie Soft Tacos
0                  0                       0                       0
1                  0                       0                       0
2                  0                       0                       0
3                  0                       0                       0
4                  0                       0                       0

[5 rows x 57 columns]

Convert tsv to csv

In [28]:
csv_file_path = '/content/chipotle.csv'
data1.to_csv(csv_file_path, sep=',', index=False)
print(f"The cleaned dataset has been successfully saved to: {csv_file_path}")

The cleaned dataset has been successfully saved to: /content/chipotle.csv